---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ForegroundAnyPatternIdParam
source: html/93658416-a391-7d9b-ce75-cfdff3038952.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ForegroundAnyPatternIdParam Property

"Foreground Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId ForegroundAnyPatternIdParam { get; }
```